starter-kit-flymake.org
#+TITLE: Starter Kit Python
#+OPTIONS: toc:nil num:nil ^:nil

This is part of the [[file:starter-kit.org][Emacs Starter Kit]].

* Starter kit Python

Support for the Python programming language.

** Check Dependencies

Determine whether required packages are installed. If not, use ELPA to
install them.
#+begin_src emacs-lisp
  (dolist (package '(flymake))
    (unless (package-installed-p package)
      (package-install package)))
#+end_src

** Use Python's python-mode.el instead of Emacs' python.el
   :PROPERTIES:
   :CUSTOM_ID: python
   :END:
Replace the Python mode that comes with Emacs by the Python mode
supplied by the Python distribution itself.
#+begin_src emacs-lisp
(require 'flymake)
#+end_src

 Use Cython mode
   :PROPERTIES:
   :CUSTOM_ID: cython
   :END:
#+begin_src emacs-lisp
(defvar flymake-mode-map (make-sparse-keymap))
(defun flymake-display-current-error ()
 "Display errors/warnings under cursor."
 (interactive)
 (let ((ovs (overlays-in (point) (1+ (point)))))
  (catch 'found
   (dolist (ov ovs)
    (when (flymake-overlay-p ov)
     (message (overlay-get ov 'help-echo))
     (throw 'found t))))))
(defun flymake-goto-next-error-disp ()
 "Go to next error in err ring, then display error/warning."
 (interactive)
 (flymake-goto-next-error)
 (flymake-display-current-error))
(defun flymake-goto-prev-error-disp ()
 "Go to previous error in err ring, then display error/warning."
 (interactive)
 (flymake-goto-prev-error)
 (flymake-display-current-error))

    (global-set-key (kbd "<f11>") 'flymake-goto-prev-error-disp)
    (global-set-key (kbd "<f12>") 'flymake-goto-next-error-disp)
    (define-key flymake-mode-map (kbd "C-c <C-f4>")
     'flymake-display-err-menu-for-current-line)
    (or (assoc 'flymake-mode minor-mode-map-alist)
     (setq minor-mode-map-alist
      (cons (cons 'flymake-mode flymake-mode-map)
        minor-mode-map-alist)))





#+end_src
   
   
